{
  "en": {
    "tool.description": "A tool for asking the human user for input when the model cannot complete an operation or decision on its own. Note: For sensitive information (passwords, etc.), set is_password=True and ask for only one item. Do not request multiple items (e.g., username + password) in a single call (use multiple calls if needed).",
    "tool.system_prompt": "This tool is used for the following purpose: asking the human user for input when the model cannot complete an operation or decision on its own and receiving the reply text.\n\nImportant: This tool can receive only ONE reply text per call. It cannot split input into multiple fields or apply different masking policies per field.\n\n[Most Important: Security]\n- If you need the user to enter sensitive information (passwords, API keys, tokens, private keys, session cookies, etc.), ALWAYS set is_password=True.\n- If is_password=True, NEVER repeat the received reply (user_reply) in your subsequent assistant messages.\n  - Bad: "Received password 'password123'. Logging in."\n  - Good: "Received the password. Starting the login process."\n- Do not store passwords or other secrets in long-term memory or shared memory.\n\nOperational guidelines:\n- If additional user input is required, always use the human_ask tool.\n- With is_password=True, ask for exactly one secret item.\n- If you need multiple items (e.g., username + password), call human_ask two or more times.\n- Do not request multiple items in a single human_ask call.\n- If handling relative dates (today/this year, etc.), call get_current_time to reference the current time.\n- When outputting files or code, output the full original content without omission (unless the user instructs otherwise).\n\nCancel:\n- To cancel, enter 'c' or 'cancel' on a single line.\n",
    "param.message.description": "Write a polite request message to the human user. (Typically in Japanese for this project.)",
    "param.is_password.description": "If true, the input will be hidden (masked). Use this for passwords or tokens."
  },
  "ja": {
    "tool.description": "モデル自身では完結しない操作・判断を、人間ユーザーに依頼し、その回答テキストを受け取るためのツール。注意: 秘匿情報(パスワード等)は is_password=True で「1項目だけ」尋ねること。ユーザー名+パスワード等の複数項目を同時に要求してはいけません（必要なら複数回呼び出す）。",
    "tool.system_prompt": "このツールは次の目的で使われます: モデル自身では完結しない操作・判断を、人間ユーザーに依頼し、その回答テキストを受け取るためのツール。\n\n重要: このツールは 1回の呼び出しで 1つの回答テキストしか受け取れません。入力を複数フィールドに分割したり、フィールドごとにマスク有無を切り替える機能はありません。\n\n【最重要: セキュリティ】\n- 秘匿情報（パスワード、APIキー、トークン、秘密鍵、セッションCookie等）を入力させる場合は、必ず is_password=True を指定してください。\n- is_password=True で取得した回答（user_reply）は、以後のあなたの返答（Assistant message）の中で**絶対に復唱しないでください**。\n  - 悪い例: 「パスワード『password123』を受け取りました。ログインします」\n  - 良い例: 「パスワードを受け取りました。ログイン処理を開始します」\n- パスワード等の秘匿情報を長期記憶や共有メモに保存しないでください。\n\nこのツールの動作指針:\n- 追加のユーザー入力が必要な場合は必ず human_ask ツールを使用してください。\n- is_password=True の呼び出しでは、秘匿情報 1項目のみを尋ねてください。\n- ユーザー名 + パスワード等が必要な場合は、必ず human_ask を2回以上に分けてください。\n- 1回の human_ask で複数項目の入力を同時に要求してはいけません。\n- 相対日付（今日／今年など）を扱う場合は get_current_time を呼んで現在時刻を参照してください。\n- ファイルやコード出力は原文全体を省略せずに出力すること（ユーザー指示がない場合）。\n\nキャンセル方法:\n- キャンセルしたい場合は 1 行で「c」または「cancel」と入力してください。\n",
    "param.message.description": "人間に依頼したい内容を、日本語で丁寧にそのまま表示できる形で書く。",
    "param.is_password.description": "true の場合、入力文字を非表示（マスク）にします。パスワードやトークンの入力に使用してください。"
  }
}
